IDEA Open Model
CalculationType Enumeration
Compatible with IDEA StatiCa 20.1
 Calculation type
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum CalculationType
Public Enumeration CalculationType
Members
Member name | Value | Description
NotDefined | 0 |  not defined check
Capacity | 1 |  calculation of capacity by the interaction diagram
Response | 2 |  calculation plane of deformation
Shear | 3 |  shear check
Torsion | 4 |  torsion check
Interaction | 5 |  interaction shear+torsion
Fatigue | 6 |  calculation - response for fatigue
StressLimitationShort | 7 |  stress limitation check - short
StressLimitationLong | 8 |  stress limitation check - long
StressLimitationStage | 9 |  stress limitation check - stage
CrackWidthShort | 10 |  crack width check - short
CrackWidthLong | 11 |  crack width check - long
CrackWidthStage | 12 |  crack width check - stage
StiffnessShort | 13 |  stiffness calculation - short
StiffnessLong | 14 |  stiffness calculation - long
StiffnessStage | 15 |  stiffness calculation - stage
Deflection | 16 |  deflection check
BrittleFailure | 17 |  brittle failure check
Detailing | 18 |  detailing check
LinearStressShort | 19 |  Linear stress check - short
LinearStressLong | 20 |  Linear stress check - long
LinearStressStage | 21 |  Linear stress check - stage
CrossSectionCharacteristicsShort | 22 |  calculation cross-section characteristics - short
CrossSectionCharacteristicsLong | 23 |  calculation cross-section characteristics - long
CrossSectionCharacteristicsStage | 24 |  calculation cross-section characteristics - stage
Baumann | 25 |  calculation internal forces for slabs/shells/walls
OverallColumnRecalculation | 26 |  all internal forces are recalculated because of slenderness/imperfections etc...
ColumnForces | 27 |  Recalculation of internal forces on compression members (effect of geometric imperfections and second order effect).
PrestressEffects | 28 |  calculation prestress effects
Primaryforces | 29 |  calculation primary forces
LongTermLosses | 30 |  calculation long term losses calculation
MNKappaDiagramULS | 31 |  calculation M-N-Kappa diagram ULS
MNKappaDiagramSLSShort | 32 |  calculation M-N-Kappa diagram SLS-short
MNKappaDiagramSLSLong | 33 |  calculation M-N-Kappa diagram SLS-long
CreepAndShrinkageCoefficient | 34 |  calculation of creep and shrinkage
ConcreteCover | 35 |  calculation of creep and shrinkage
CrackingCalculation | 36 |  calculation if cross section is cracked
CrackingCalculationShort | 37 |  calculation if cross section is cracked
CrackingCalculationLong | 38 |  calculation if cross section is cracked
Redistribution | 39 |  calculation of redistribution
InitilaStateofCrossSection | 40 |  initial state of cross-section
StrutAngle | 41 |  angle of concrete strut
DesignReinforcement | 42 |  desing of reinforcement
CapacityMesh | 43 |  interaction diagram on mesh
StiffnessStageLong | 44 |  calculation siffness with effective modulus of elasticity
LongTermLossesCoefficient | 45 |  calculation long-term losses coefficient
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace